app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]