app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-04-07 13:36:05.571205"], ["id", 4]]
INSERT INTO "comments" ("user_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["post_id", 3], ["text", "am gonna delete your post"], ["created_at", "2023-04-14 08:35:31.084631"], ["updated_at", "2023-04-14 08:35:31.084631"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.post = Post.find(params[:post_id])

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) - $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 3]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @post = Post.find(params[:post_id])

    # @comment = current_user.comments.find_by(id: params[:id])
    if @comment&.destroy
      flash[:success] = 'Comment deleted!'
      @comment.post.decrement!(:comments_counter) # Decrease the comments count by 1 for the post