app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @pagy, @user_posts = pagy(Post.where(author_id: @user.id).includes(:author))
    @user_comments = Comment.where(user_id: @user.id).includes(:post)
    @post_comments = Comment.where(post_id: @user_posts.ids).includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "posts"."id" FROM "posts" LEFT OUTER JOIN "users" ON "users"."id" = "posts"."author_id" WHERE "posts"."author_id" = $1 LIMIT $2 OFFSET $3  [["author_id", 3], ["LIMIT", 0], ["OFFSET", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3)  [["post_id", 1], ["post_id", 3], ["post_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]

  def show
    @post = Post.find(params[:id])
    @post_comments = Comment.where(post_id: @post)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @post = Post.new(post_params)
    @post.author = current_user
    @post.comments_counter = 0
    @post.likes_counter = 0

    if @post.save
---
INSERT INTO "posts" ("author_id", "title", "text", "comments_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @post = Post.find(params[:id])

    if @post&.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]