app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
---
  def show
  @user = User.find(params[:id])
  @user_posts = Post.where(author_id: @user.id)