app/models/comment.rb

  def update_comments_counter
    post.update(comments_counter: post.comments_counter + 1)
---
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-04-07 13:36:05.571205"], ["id", 4]]