app/models/like.rb

UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-04-07 19:37:34.783241"], ["id", 3]]
---
  def update_likes_counter
    post.update(likes_counter: post.likes_counter + 1)